import json
import asyncio
import websockets

import language_processor as lp
import string

keys = [["срочно", "не срочно", "позже", "неважно", "немедленно", "быстро", "критически", "опасно", "важно",
         "не важно", "серьёзно", "опасность", "угроза", "травма", "ужас", "скорее", "экстренно", "врач",
         "больница", "боль"],
        ["до xx:xx", "xx:xx", "после xx:xx", "в полдень", "днем", "ночью", "после обеда", "во время обеда",
         "после работы", "после смены", "перед сменой", "после смены", "во время смены", "завтра",
         "послезавтра", "вчера", "позавчера", "сегодня"],
        ["техническое задание", "технологическое задание", "организационное задание", "техзадание", "ТЗ",
         "починить", "сообщить", "сообщение", "сообщаю", "заявляю", "уведомить", "отработать", "пожаловаться",
         "жалоба", "жалуюсь", "уведомляю", "уведомление", "предложение", "объяснение", "восстановить", "печь",
         "механизм", "конструкция", "стержень", "трос", "станок", "пресс", "заготовки", "плавильня", "ремонт",
         "пресс", "экскаватор"],
        ["мастер", "мастеру", "технолог", "инженер", "инженеру", "работник", "сотрудник", "начальник участка",
         "руководитель", "начальник", "все"],
        ["цех", "корпус", "завод", "участок", "площадка"]]

# keys = ["немедленно", "быстро", "важно", "срочно", "31", "3381","317", "15:34", "участок", "цех", "механизм", "станок","печь", "мастер", "участок", "работник", "технолог", "инженер по ремонту", "начальник участка", "корпус", "руководитель младшего звена", "руководитель среднего звена"]

lp.load_keys(keys, "key_vectors.json")


def handle(in_string):
    if in_string:
        res = lp.keys_grouped_check(in_string)
        return json.dumps(res)


async def server(websocket, path):
    async for message in websocket:
        await websocket.send(handle(message))


asyncio.get_event_loop().run_until_complete(
    websockets.serve(server, '0.0.0.0', 49490))
asyncio.get_event_loop().run_forever()
